app/controllers/beers_controller.rb

  def index
    @beers = Beer.all
---
SELECT "beers".* FROM "beers"

  def create
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save
---
INSERT INTO "beers" ("brewery_id", "created_at", "name", "style_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["brewery_id", 6], ["created_at", Wed, 05 Feb 2014 18:46:14 UTC +00:00], ["name", "Sierra Nevada Pale Ale"], ["style_id", 2], ["updated_at", Wed, 05 Feb 2014 18:46:14 UTC +00:00]]

  def update
    respond_to do |format|
      if @beer.update(beer_params)
---
UPDATE "beers" SET "name" = ?, "updated_at" = ? WHERE "beers"."id" = 6  [["name", "Hefeweizen"], ["updated_at", Thu, 30 Jan 2014 18:16:45 UTC +00:00]]

  def destroy
    @beer.destroy
---
DELETE FROM "beers" WHERE "beers"."id" = ?  [["id", 11]]

    def set_breweries_and_styles_for_template
      @breweries = Brewery.all
      @styles = Style.all
---
SELECT "breweries".* FROM "breweries"
SELECT "styles".* FROM "styles"

    def set_beer
      @beer = Beer.find(params[:id])
---
SELECT "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT 1  [["id", "11"]]